note-shortcutes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-27 Sat 17:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>一些快捷键 系统命令</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />

</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">一些快捷键 系统命令</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org40aa3cb">win10 shortcuts</a></li>
<li><a href="#org6964df9">vim</a></li>
<li><a href="#org3423fca">commands</a></li>
<li><a href="#org422ea24">grep</a></li>
</ul>
</div>
</div>
<div id="outline-container-org40aa3cb" class="outline-2">
<h2 id="org40aa3cb">win10 shortcuts</h2>
<div class="outline-text-2" id="text-org40aa3cb">
<p>
win+ctrl+left/right 切换工作区
</p>
</div>
</div>
<div id="outline-container-org6964df9" class="outline-2">
<h2 id="org6964df9">vim</h2>
<div class="outline-text-2" id="text-org6964df9">
<ol class="org-ol">
<li><p>
常用组合
不按 Esc 而是按^[或者^c，速度快很多
学会几个定位键的区别: C-^ 0, $, {, }, g, G, w, e, b&#x2026;
o, O 分别是当前位置下面/上面插入一个新行并进入插入状态
Shift+V 选定几行，然后用 一起移动
Ctrl+V 选定行首或行尾的字符，然后用 shift+i 做插入，或者 shift+x 做删除
学会用 y,d 和 p, P 做粘贴剪切
学会用^W 的窗口操作。打开文件用 sp 或者 vs
学会记录宏的命令。用 q 加任意键开始录制，再按 q 保存。然后可用@加这个任意键回放，在@前加数字可定义回放次数。
"."重复上一个命令，"u"取消上一个命令,"^r"反取消
^n, ^p 用 buf 里的关键词补全。
学会搜索替换":%s/要搜的东西/要换成的东西/g"
任何时候移到一个单词上按#的话可以高亮这个文档里所有一样的单词
用“/”做搜索, 按 n 或 N 上一个/下一个
":!命令 &amp;"可直接运行这个命令，用":!命令 %&amp;"如果你想让这个命令对当前所编辑文件做操作。
任何时候可用":cd %:p:h"来切换目录到当前编辑文件所在目录。
ddp 呼唤行位置
r/R  # [N]这两个是替换字符的命令
</p>

<p>
:reg     "0p  寄存器使用
</p>

<p>
行内跳转:
 fc 第一个 c   /str 查找定位到一个
 80 l 向左移动 80 格子
 80 | 直接移动到第 80 列
</p>

<p>
       创建折叠:
zf zc zo
</p></li>
<li>每行行首行尾插入
每行的行首都添加一个字符串：%s/^/要插入的字符串
每行的行尾都添加一个字符串：%s/$/要插入的字符串</li>
</ol>
</div>
</div>
<div id="outline-container-org3423fca" class="outline-2">
<h2 id="org3423fca">commands</h2>
<div class="outline-text-2" id="text-org3423fca">
<p>
查找文件比较大的
find ~ -type f -exec du {} + &gt; /tmp/size_report.txt
sort -rn /tmp/size_report.txt | head -n20
</p>

<p>
2042  curl 10.6.109.60:9200/_cat/indices
2043  curl 10.6.109.60:9200/_cat/indices/vul*
2044  sudo iftop -n
 nload  查看进出流量
</p>
</div>
</div>
<div id="outline-container-org422ea24" class="outline-2">
<h2 id="org422ea24">grep</h2>
<div class="outline-text-2" id="text-org422ea24">
<p>
grep -r "y_T" <i>home/manue1/work</i>  查找代码
</p>
</div>
</div>
</div>
</body>
</html>